docs/stage-1/wrk_outputs/get_empty_wrk_out.txt
Running 2m test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 4083.163ms, rate sampling interval: 10567ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    20.43s     2.79s   25.41s    78.31%
    Req/Sec   811.40    221.88     1.01k    90.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   20.48s
 75.000%   22.23s
 90.000%   23.38s
 99.000%   25.38s
 99.900%   25.43s
 99.990%   25.43s
 99.999%   25.43s
100.000%   25.43s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5427.199     0.000000           27         1.00
   16973.823     0.100000         9136         1.11
   19513.343     0.200000        18229         1.25
   20037.631     0.300000        27456         1.43
   20103.167     0.400000        37941         1.67
   20479.999     0.500000        45912         2.00
   20725.759     0.550000        50420         2.22
   20774.911     0.600000        54822         2.50
   20824.063     0.650000        58807         2.86
   21184.511     0.700000        62960         3.33
   22233.087     0.750000        67586         4.00
   22364.159     0.775000        69772         4.44
   22511.615     0.800000        72120         5.00
   22675.455     0.825000        74358         5.71
   22872.063     0.850000        76866         6.67
   22970.367     0.875000        78770         8.00
   23134.207     0.887500        79967         8.89
   23379.967     0.900000        81149        10.00
   23429.119     0.912500        82311        11.43
   23478.271     0.925000        83475        13.33
   23511.039     0.937500        84354        16.00
   23576.575     0.943750        85420        17.78
   23674.879     0.950000        85446        20.00
   25329.663     0.956250        86530        22.86
   25346.047     0.962500        87360        26.67
   25346.047     0.968750        87360        32.00
   25362.431     0.971875        88690        35.56
   25362.431     0.975000        88690        40.00
   25362.431     0.978125        88690        45.71
   25362.431     0.981250        88690        53.33
   25362.431     0.984375        88690        64.00
   25362.431     0.985938        88690        71.11
   25378.815     0.987500        89361        80.00
   25378.815     0.989062        89361        91.43
   25378.815     0.990625        89361       106.67
   25378.815     0.992188        89361       128.00
   25378.815     0.992969        89361       142.22
   25395.199     0.993750        89433       160.00
   25411.583     0.994531        89708       182.86
   25411.583     0.995313        89708       213.33
   25411.583     0.996094        89708       256.00
   25411.583     0.996484        89708       284.44
   25411.583     0.996875        89708       320.00
   25411.583     0.997266        89708       365.71
   25427.967     0.997656        89942       426.67
   25427.967     1.000000        89942          inf
#[Mean    =    20434.994, StdDeviation   =     2788.960]
#[Max     =    25411.584, Total count    =        89942]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  94539 requests in 2.00m, 6.22MB read
  Non-2xx or 3xx responses: 94539
Requests/sec:    788.14
Transfer/sec:     53.11KB